Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPL_DFP/1.3.57/edc/PIC32MM0032GPL020.PIC
      <edc:AdjustPoint edc:_addr="0x1F802500" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x1F802520" edc:_begin="0x230" edc:_end="0x240" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="5" edc:access="---nnnnn---nnnnn----------------" edc:cname="RPINR9" edc:desc="" edc:impl="0x1f1f0000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000----------------" edc:name="RPINR9" edc:nzwidth="32" edc:por="---00000---00000----------------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="16"/>
            <edc:SFRFieldDef edc:cname="U2RXR" edc:mask="0x1f" edc:name="U2RXR" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="U2CTSR" edc:mask="0x1f" edc:name="U2CTSR" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F802530" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x1F802540" edc:_begin="0x240" edc:_end="0x260" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="6" edc:access="-----------nnnnn---nnnnn---nnnnn" edc:cname="RPINR11" edc:desc="" edc:impl="0x1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------00000---00000---00000" edc:name="RPINR11" edc:nzwidth="32" edc:por="-----------00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SDI2R" edc:desc="" edc:mask="0x1f" edc:name="SDI2R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SCK2INR" edc:desc="" edc:mask="0x1f" edc:name="SCK2INR" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SS2INR" edc:desc="" edc:mask="0x1f" edc:name="SS2INR" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802550" edc:_begin="0x240" edc:_end="0x260" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="6" edc:access="---nnnnn---nnnnn----------------" edc:cname="RPINR12" edc:desc="" edc:impl="0x1f1f0000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000----------------" edc:name="RPINR12" edc:nzwidth="32" edc:por="---00000---00000----------------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="16"/>
            <edc:SFRFieldDef edc:cname="CLCINAR" edc:desc="" edc:mask="0x1f" edc:name="CLCINAR" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CLCINBR" edc:desc="" edc:mask="0x1f" edc:name="CLCINBR" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F802560" edc:offset="0x30"/>
      <edc:SFRDef edc:_addr="0x1F802590" edc:_begin="0x260" edc:_end="0x2b0" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="7" edc:access="----nnnn----nnnn----nnnn----nnnn" edc:cname="RPOR0" edc:desc="" edc:impl="0xf0f0f0f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000----0000----0000----0000" edc:name="RPOR0" edc:nzwidth="32" edc:por="----0000----0000----0000----0000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RP1R" edc:desc="" edc:mask="0xf" edc:name="RP1R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="RP2R" edc:desc="" edc:mask="0xf" edc:name="RP2R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="RP3R" edc:desc="" edc:mask="0xf" edc:name="RP3R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="RP4R" edc:desc="" edc:mask="0xf" edc:name="RP4R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8025A0" edc:_begin="0x260" edc:_end="0x2b0" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="7" edc:access="----nnnn----nnnn----nnnn----nnnn" edc:cname="RPOR1" edc:desc="" edc:impl="0xf0f0f0f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000----0000----0000----0000" edc:name="RPOR1" edc:nzwidth="32" edc:por="----0000----0000----0000----0000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RP5R" edc:desc="" edc:mask="0xf" edc:name="RP5R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="RP6R" edc:desc="" edc:mask="0xf" edc:name="RP6R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="RP7R" edc:desc="" edc:mask="0xf" edc:name="RP7R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="RP8R" edc:desc="" edc:mask="0xf" edc:name="RP8R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8025B0" edc:_begin="0x260" edc:_end="0x2b0" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="7" edc:access="----nnnn----nnnn----nnnn----nnnn" edc:cname="RPOR2" edc:desc="" edc:impl="0xf0f0f0f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000----0000----0000----0000" edc:name="RPOR2" edc:nzwidth="32" edc:por="----0000----0000----0000----0000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RP9R" edc:desc="" edc:mask="0xf" edc:name="RP9R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="RP10R" edc:desc="" edc:mask="0xf" edc:name="RP10R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="RP11R" edc:desc="" edc:mask="0xf" edc:name="RP11R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="RP12R" edc:desc="" edc:mask="0xf" edc:name="RP12R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8025C0" edc:_begin="0x260" edc:_end="0x2b0" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="7" edc:access="----nnnn----nnnn----nnnn----nnnn" edc:cname="RPOR3" edc:desc="" edc:impl="0xf0f0f0f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000----0000----0000----0000" edc:name="RPOR3" edc:nzwidth="32" edc:por="----0000----0000----0000----0000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RP13R" edc:desc="" edc:mask="0xf" edc:name="RP13R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="RP14R" edc:desc="" edc:mask="0xf" edc:name="RP14R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="RP15R" edc:desc="" edc:mask="0xf" edc:name="RP15R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="RP16R" edc:desc="" edc:mask="0xf" edc:name="RP16R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8025D0" edc:_begin="0x260" edc:_end="0x2b0" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="7" edc:access="----nnnn----nnnn----nnnn----nnnn" edc:cname="RPOR4" edc:desc="" edc:impl="0xf0f0f0f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000----0000----0000----0000" edc:name="RPOR4" edc:nzwidth="32" edc:por="----0000----0000----0000----0000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RP17R" edc:desc="" edc:mask="0xf" edc:name="RP17R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="RP18R" edc:desc="" edc:mask="0xf" edc:name="RP18R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="RP19R" edc:desc="" edc:mask="0xf" edc:name="RP19R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="RP20R" edc:desc="" edc:mask="0xf" edc:name="RP20R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8025E0" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x1F802600" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="8" edc:access="----------------------------nnnn" edc:cname="ANSELA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff000f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1111" edc:name="ANSELA" edc:nzwidth="0x20" edc:por="----------------------------1111" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ANSA0" edc:desc="" edc:mask="0x1" edc:name="ANSA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSA1" edc:desc="" edc:mask="0x1" edc:name="ANSA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSA2" edc:desc="" edc:mask="0x1" edc:name="ANSA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSA3" edc:desc="" edc:mask="0x1" edc:name="ANSA3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802610" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="8" edc:access="---------------------------nnnnn" edc:cname="TRISA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff001f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------11111" edc:name="TRISA" edc:nzwidth="0x20" edc:por="---------------------------11111" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISA0" edc:desc="" edc:mask="0x1" edc:name="TRISA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA1" edc:desc="" edc:mask="0x1" edc:name="TRISA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA2" edc:desc="" edc:mask="0x1" edc:name="TRISA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA3" edc:desc="" edc:mask="0x1" edc:name="TRISA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA4" edc:desc="" edc:mask="0x1" edc:name="TRISA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802620" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="8" edc:access="---------------------------nnnnn" edc:cname="PORTA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff001f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------xxxxx" edc:name="PORTA" edc:nzwidth="0x20" edc:por="---------------------------xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RA0" edc:desc="" edc:mask="0x1" edc:name="RA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA1" edc:desc="" edc:mask="0x1" edc:name="RA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA2" edc:desc="" edc:mask="0x1" edc:name="RA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA3" edc:desc="" edc:mask="0x1" edc:name="RA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA4" edc:desc="" edc:mask="0x1" edc:name="RA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
