Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPL_DFP/1.3.57/edc/PIC32MM0032GPL020.PIC
      <edc:SFRDef edc:_addr="0x1F802C40" edc:_begin="0x150" edc:_end="0x1d0" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="10" edc:access="-------------------------------n" edc:cname="PMD4" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------------0" edc:name="PMD4" edc:nzwidth="32" edc:por="-------------------------------0" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T1MD" edc:desc="" edc:mask="0x1" edc:name="T1MD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802C50" edc:_begin="0x150" edc:_end="0x1d0" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="10" edc:access="--------------nn------nn------nn" edc:cname="PMD5" edc:desc="" edc:impl="0x30303" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00------00------00" edc:name="PMD5" edc:nzwidth="32" edc:por="--------------00------00------00" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U1MD" edc:desc="" edc:mask="0x1" edc:name="U1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2MD" edc:desc="" edc:mask="0x1" edc:name="U2MD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="SPI1MD" edc:desc="" edc:mask="0x1" edc:name="SPI1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2MD" edc:desc="" edc:mask="0x1" edc:name="SPI2MD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="I2C1MD" edc:desc="" edc:ishidden="true" edc:isidehidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="I2C1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2MD" edc:desc="" edc:ishidden="true" edc:isidehidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="I2C2MD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802C60" edc:_begin="0x150" edc:_end="0x1d0" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="10" edc:access="-----------------------n-------n" edc:cname="PMD6" edc:desc="" edc:impl="0x101" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------0-------0" edc:name="PMD6" edc:nzwidth="32" edc:por="-----------------------0-------0" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RTCCMD" edc:desc="" edc:mask="0x1" edc:name="RTCCMD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="REFOMD" edc:desc="" edc:mask="0x1" edc:name="REFOMD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802C70" edc:_begin="0x150" edc:_end="0x1d0" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="10" edc:access="----------------------------n---" edc:cname="PMD7" edc:desc="" edc:impl="0x8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0---" edc:name="PMD7" edc:nzwidth="32" edc:por="----------------------------0---" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CRCMD" edc:desc="" edc:mask="0x1" edc:name="CRCMD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F802C80" edc:offset="0xe80"/>
      <edc:SFRDef edc:_addr="0x1F803B00" edc:_begin="0x390" edc:_end="0x3a0" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="11" edc:access="--------nnnnnnnn------------n---" edc:cname="CFGCON" edc:desc="" edc:impl="0xff0008" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000------------0---" edc:name="CFGCON" edc:nzwidth="0x20" edc:por="--------00000000------------0---" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="JTAGEN" edc:mask="0x1" edc:name="JTAGEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="EXECADDR" edc:mask="0xff" edc:name="EXECADDR" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F803B10" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x1F803B20" edc:_begin="0x3a0" edc:_end="0x3c0" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="12" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVID" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="DEVID" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MAINID" edc:mask="0xfff" edc:name="MAINID" edc:nzwidth="0xc"/>
            <edc:SFRFieldDef edc:cname="PN" edc:mask="0xffff" edc:name="PN" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="VER" edc:mask="0xf" edc:name="VER" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
